      ******************************************************************
      * Author: MAXIMILIANO LOZON
      * Purpose: AREA DE COMUNICACION DE LA RUTINA MATERIAS
        01 AreaDeComunicacionMateria.
           05 Opcion-materia PIC 9.
           05 RETORNO.
               10 DESC-ERROR PIC X(25).
               10 RET-COD PIC XX.
           05 Codigo-materia PIC 99.
           05 NOMBRE-MATERIA PIC X(30).
      ******************************************************************
