       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGENPAIS.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT NACIONALIDAD             ASSIGN TO "NACIONALIDAD.DAT"
                                       ORGANIZATION IS LINE SEQUENTIAL
                                           FILE STATUS IS WS-FS-NAC.

       DATA DIVISION.
       FILE SECTION.
       FD NACIONALIDAD.
           01 NACIONALIDAD-REGISTRO.
              05 NAC-CODIGO PIC 999.
              05 NAC-PAIS PIC X(20).

       WORKING-STORAGE SECTION.
      *  WorkingStorage-FileStatus-Nacionalidad.
       01 WS-FS-NAC PIC XX.
           88 WS-FS-NAC-OK VALUE "00".
           88 WS-FS-NAC-NO VALUE "10".
       77 WS-NAC-COD PIC 999.
       77 WS-NAC-PAIS PIC X(20) VALUE SPACES.
       01 WS-CONTROL PIC XX.
           88 WS-CONTROL-OK VALUE "SI".
           88 WS-CONTROL-NO VALUE "NO".

       PROCEDURE DIVISION.
       0000-MAIN-PROCEDURE.
           DISPLAY "COMIENZA EL PROGRMA"
           DISPLAY "ABRIR ARCHIVO" WS-FS-NAC
           PERFORM 1000-ABRIR-ARCHIVO
           DISPLAY "SOLICITAR CODIGO Y PAIS" WS-FS-NAC
           PERFORM 2000-PROCES-INFO UNTIL WS-CONTROL-NO OR WS-FS-NAC-NO
           DISPLAY "GUARDAR INFORMACION EN EL ARCHIVO" WS-FS-NAC
           DISPLAY "CERRAR ARCHIVO" WS-FS-NAC
           PERFORM 4000-CERRAR-ARCHIVO
           DISPLAY "TERMINA EL PROGRAMA"
           STOP RUN.

           1000-ABRIR-ARCHIVO.
               OPEN OUTPUT NACIONALIDAD.
               IF NOT WS-FS-NAC-OK THEN
                   DISPLAY "ERROR AL ABRIR ARCHIVO"
                   DISPLAY "FILE STATUS " WS-FS-NAC
               END-IF.
           2000-PROCES-INFO.
               DISPLAY "INGRESA CODIGO DEL PAIS" ACCEPT WS-NAC-COD
               DISPLAY "INGRESA NOMBRE DEL PAIS" ACCEPT WS-NAC-PAIS
               MOVE WS-NAC-COD TO NAC-CODIGO
               MOVE WS-NAC-PAIS TO NAC-PAIS.
               PERFORM 2100-GUARDAR-INFO
               DISPLAY "INGRESAR OTRO PAIS? SI/NO" ACCEPT WS-CONTROL.

           2100-GUARDAR-INFO.
               WRITE NACIONALIDAD-REGISTRO
               IF NOT WS-FS-NAC-OK THEN
                   DISPLAY "ERROR AL CARGAR REGISTRO"
                   DISPLAY "FILE STATUS " WS-FS-NAC
               END-IF.
           4000-CERRAR-ARCHIVO.
               CLOSE NACIONALIDAD.
               IF NOT WS-FS-NAC-OK THEN
                   DISPLAY "ERROR AL CERRAR ARCHIVO"
                   DISPLAY "FILE STATUS " WS-FS-NAC
               END-IF.

       END PROGRAM PGENPAIS.
